{
  "_class_name": "WanTransformer3DModel",
  "_diffusers_version": "0.33.0.dev0",
  "patch_size": [
    1,
    2,
    2
  ],
  "num_attention_heads": 12,
  "attention_head_dim": 128,
  "in_channels": 48,
  "out_channels": 16,
  "text_dim": 4096,
  "freq_dim": 256,
  "ffn_dim": 8960,
  "num_layers": 30,
  "cross_attn_norm": true,
  "qk_norm": "rms_norm_across_heads",
  "eps": 1e-06,
  "image_dim": 1280,
  "added_kv_proj_dim": 1536,
  "rope_max_seq_len": 1024
}